{
  "backend/main.mo": "Motoko canister defining user profiles, bio inputs, alerts, dreams, rituals, and settings with access‑controlled CRUD operations and alert generation logic.",
  "feature_evidence.json": "Feature evidence manifest linking high‑level ritual and UI features to specific frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend pages, components, and hooks for navigation, rituals, chronicle, true‑time, dreams, and system utilities.",
  "frontend/index.css": "Tailwind base stylesheet defining theme variables, light/dark modes, and global background/foreground styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all pages including the BIOS‑TIME ritual and wraps the app with I18n and TTS providers.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing and error handling.",
  "frontend/src/components/chronicle/Timeline.tsx": "Renders chronicle entries with period badges, descriptions, and TTS controls in a vertical timeline layout.",
  "frontend/src/components/dashboard/MemoryAnchorCard.tsx": "Displays a daily memory anchor with date navigation, anchor content, and TTS controls inside a styled card.",
  "frontend/src/components/dreams/DreamEditor.tsx": "Modal editor for creating or updating dream entries, storing them in localStorage with content, tags, and mood.",
  "frontend/src/components/dreams/DreamList.tsx": "Displays stored dream entries from localStorage with date, mood, tags, and allows selecting one for editing.",
  "frontend/src/components/layout/AppShell.tsx": "Overall application layout with header, footer, navigation, and an Outlet wrapped in an error boundary.",
  "frontend/src/components/nav/PrimaryNav.tsx": "Responsive primary navigation bar rendering route buttons with icons and mobile sheet navigation.",
  "frontend/src/components/ritual-bios-time/BiosTimeRitualShell.tsx": "Full‑screen ritual container applying themed gradients, mute/exit controls, and wrapping ritual content.",
  "frontend/src/components/ritual-bios-time/RitualNotices.tsx": "Displays temporary ritual notices as alert panels for audio, orientation, or vibration issues.",
  "frontend/src/components/ritual-bios-time/screens/BloomScreen.tsx": "Interactive bloom screen using drag direction, audio, and vibration effects to select petals and trigger transitions.",
  "frontend/src/components/ritual-bios-time/screens/BoussoleScreen.tsx": "Compass alignment screen using device heading, spatial audio, vibration feedback, and canvas animation to signal alignment.",
  "frontend/src/components/ritual-bios-time/screens/SouffleScreen.tsx": "Animated canvas showing pulsing oculus and orbiting glyphs with long‑press handling and status-based visuals.",
  "frontend/src/components/rituals/RitualChecklist.tsx": "Displays saved rituals, tracks daily completions via localStorage, and shows progress for the past 7 days.",
  "frontend/src/components/rituals/RitualEditor.tsx": "Form for creating rituals with title, description, weekly schedule, and optional time, saving entries to localStorage.",
  "frontend/src/components/sound/SoundTherapyModule.tsx": "Sound therapy player with presets, duration control, safety notice gating, and playback controls via a custom hook.",
  "frontend/src/components/system/ErrorBoundary.tsx": "React error boundary that catches render errors and shows a reload prompt with optional error message.",
  "frontend/src/components/system/NonBlockingErrorAlert.tsx": "Dismissible inline error alert component with customizable title and message.",
  "frontend/src/components/system/RouteErrorComponent.tsx": "Full-page error display for route-level failures with reload option and optional error text.",
  "frontend/src/components/true-time/AnalemmaViz.tsx": "Canvas visualization of the solar analemma with scaled points, date marker, and emblem overlay.",
  "frontend/src/components/true-time/EquationOfTimePanel.tsx": "Displays the Equation of Time for a selected date, with navigation buttons, formatted date output, and explanatory text.",
  "frontend/src/components/true-time/HorizonDial.tsx": "Renders a canvas-based horizon dial showing day phases, markers, and current time position using a live ticker.",
  "frontend/src/components/tts/TtsControls.tsx": "Provides play, pause, resume, and stop controls for text-to-speech playback using the browser's SpeechSynthesis API.",
  "frontend/src/components/vortex/VortexModule.tsx": "Implements an ultradian cycle focus timer with selectable cycle length, phase display, and upcoming zenith/nadir times.",
  "frontend/src/content/ethicsPrinciples.ts": "Exports a list of ethics principles outlining data privacy, guidance philosophy, and human-centered design values.",
  "frontend/src/data/chronicleEntries.ts": "Defines a chronological list of Holocene-era historical entries with period labels, titles, and descriptions.",
  "frontend/src/data/memoryAnchors.ts": "Provides date-based memory anchor texts and a lookup function returning historical context for specific calendar days.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useCompassSpatialAudio.ts": "Creates and manages a spatial sine‑wave oscillator that adjusts volume and stereo panning based on alignment state.",
  "frontend/src/hooks/useDayPhasePalette.ts": "Determines day phase from current hour and exposes a matching color palette that updates every minute.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context-driven Internet Identity auth handling, including login, stored identity loading, and status management.",
  "frontend/src/hooks/useLandscapeTrigger.ts": "Detects whether the device is in landscape orientation using matchMedia with support for legacy and modern browsers.",
  "frontend/src/hooks/useLongPress.ts": "Implements long‑press detection with a timeout and exposes pointer event handlers.",
  "frontend/src/hooks/useNowTicker.ts": "Returns a Date value that updates at a specified interval via setInterval.",
  "frontend/src/hooks/useOrientationOrSimulatedHeading.ts": "Provides device heading data using DeviceOrientation when available, falling back to a simulated heading when unsupported.",
  "frontend/src/hooks/usePointerDragVector.ts": "Tracks pointer drag direction once movement exceeds a threshold and exposes drag lifecycle handlers.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in react‑query hooks for fetching and mutating user data, alerts, dreams, rituals, and settings.",
  "frontend/src/hooks/useRitualAudio.ts": "Generates a harmonic pad using multiple oscillators and manages audio playback state.",
  "frontend/src/hooks/useSoundTherapy.ts": "Controls timed sine‑wave sound therapy sessions with start, pause, and stop functions.",
  "frontend/src/hooks/useVibrationFeedback.ts": "Offers a simple wrapper around navigator.vibrate with support detection and error handling.",
  "frontend/src/hooks/useVortexTimer.ts": "Custom hook managing a two-phase focus/release timer with start/stop controls and interval-based countdown.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables, parchment styling, and ritual-specific UI classes.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/BiosTimeRitualPage.tsx": "Controls state transitions between Souffle, Bloom, and Boussole ritual screens, reacting to device orientation.",
  "frontend/src/pages/ChroniclePage.tsx": "Displays the Holocene Chronicle with a header, disclaimer alert, and timeline component.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard handling user auth state, profile setup dialog, date display, and navigation to rituals.",
  "frontend/src/pages/DreamJournalPage.tsx": "Dream journal interface with editor and list components for creating and editing dream entries.",
  "frontend/src/pages/EthicsDisclaimersPage.tsx": "Shows medical, privacy, and content disclaimers plus ethical principles with optional text‑to‑speech.",
  "frontend/src/pages/RitualsPage.tsx": "Provides tabs for Vortex focus module and personal ritual tools including editor and checklist.",
  "frontend/src/pages/SettingsPage.tsx": "A settings UI allowing users to change language, date display, privacy sync, TTS, and export local data.",
  "frontend/src/pages/TrueTimePage.tsx": "Page displaying Horizon Dial, Analemma, and Equation of Time visualizations with tab navigation.",
  "frontend/src/state/i18n/I18nProvider.tsx": "Provides i18n context storing UI language and translate function using saved preferences.",
  "frontend/src/state/i18n/strings.ts": "Defines translation keys and English/French string mappings for UI text.",
  "frontend/src/state/i18n/useI18n.ts": "Exports a hook that returns the i18n context.",
  "frontend/src/state/preferences/dateDisplay.ts": "Stores and retrieves the chosen HE/Gregorian date display preference from localStorage.",
  "frontend/src/state/preferences/privacySettings.ts": "Manages a syncEnabled privacy setting persisted in localStorage.",
  "frontend/src/state/preferences/soundSafetyNotice.ts": "Tracks whether the user acknowledged the sound safety notice via localStorage.",
  "frontend/src/state/preferences/ttsSettings.ts": "Gets and sets whether TTS is enabled, saved in localStorage.",
  "frontend/src/state/preferences/uiLanguage.ts": "Handles UI language preference with browser-language fallback and localStorage persistence.",
  "frontend/src/state/tts/TtsProvider.tsx": "Provides TTS support state, persistence, and feature detection via context.",
  "frontend/src/utils/astronomy/analemmaModel.ts": "Generates analemma coordinate points using EOT and solar declination formulas.",
  "frontend/src/utils/astronomy/equationOfTime.ts": "Computes equation of time for a given date using an approximate formula.",
  "frontend/src/utils/audio/soundTherapyPresets.ts": "Defines sound therapy preset lists with frequencies and descriptions.",
  "frontend/src/utils/dates/dayKey.ts": "Utility functions for day-of-year calculation and date offsetting.",
  "frontend/src/utils/dates/holocene.ts": "Converts dates to Holocene Era and formats them based on display preference.",
  "frontend/src/utils/export/exportJson.ts": "Exports app data (dreams, rituals, completions) from localStorage as a JSON file.",
  "frontend/src/utils/time/releaseMoments.ts": "Calculates the next zenith or nadir moment relative to the current time.",
  "frontend/src/utils/tts/speechSynthesis.ts": "Provides speech synthesis support checks and a controller for speaking, pausing, and stopping TTS.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL and hash parameters, persisting them in sessionStorage, and cleaning parameters from the hash without reload.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins for the project's design system.",
  "project_state.json": "Defines the project's state, goals, required features, assets, and known issues for building the BIOS‑TIME ritual web prototype."
}